[
  {
    "name": "AJR Designs",
    "link": "https://codepen.io/arizzo/pen/BZwXow",
    "devType": "ReactJS",
    "bullet1": "This very site was created with ReactJS",
    "bullet2": "My newest pursuit in web development is ReactJS. I'm drawn to it as a freelance developer because it enables me to make beautiful, single page applications (SPAs) for business owners or others looking to create a professional-looking website."
  },
  {
    "name": "Local Weather App",
    "link": "https://codepen.io/arizzo/pen/BZwXow",
    "devType": "JS/HTML/CSS",
    "bullet1": "Allows the user to enter a zip code and receive the current temperature and weather conditions.",
    "bullet2": "This was my first experience with accessing an API to grab data for any app. A lot of what I had learned from programming before was applicable in the same manner over and over. With APIs, I quickly learned that they all act a bit different from the rest. This was perhaps my most challenging project to complete but once done by far my most rewarding."
  },
  {
    "name": "TwitchTV App",
    "link": "https://codepen.io/arizzo/pen/YQgrYN",
    "devType": "JS/HTML/CSS",
    "bullet1": "Shows list of Twitch streamers, whether they are online, offline or do not exist, what they are currently playing with filtering and option to add additional streamer to list.",
    "bullet2": "Building off of my API experience from the weather app, I was able to create this TwitchTV app. The newest skill I learned, to go along with brushing up on my API skills, was to be able to filter the data using jQuery instead of having the page reload on clicks."
  },
  {
    "name": "Tic-Tac-Toe",
    "link": "https://github.com/R1zzo23/Tic-Tac-Toe",
    "devType": "JS/HTML/CSS",
    "bullet1": "Basic game of Tic-Tac-Toe against AI that keeps win-loss-tie record of the current session.",
    "bullet2": "This project was my first experience with programming AI to think and react to different situations within the game. This didn’t just test my programming experience but my thought process heading into the project as I needed to think about all the different moves or countermoves the AI would need to have."
  },
  {
    "name": "Simon",
    "link": "https://github.com/R1zzo23/Simon",
    "devType": "JS/HTML/CSS",
    "bullet1": "Web app for the memory game Simon.",
    "bullet2": "This project not only gave me my first experience with utilizing sounds in any of my apps but it was my first collaborative project with someone I have never met before. We were both working on the project at the same time, found each other in a Facebook group and decided that collaborating is a skill we would both need in the future and worked on this together. Learning to blend my coding style with someone else’s was a great experience that has changed my work to this day."
  },
  {
    "name": "Ticketing System",
    "link": "https://github.com/R1zzo23/csharp-ticketing-system",
    "devType": "C#/.NET",
    "bullet1": "Simple ticketing system utilizing the MVC architectural pattern.",
    "bullet2": "This project was my first dive into using the MVC design pattern. It taught me a lot about how to separate responsibilities between the models, views and controllers so that I wasn’t creating functions or objects responsible for more than one action."
  },
  {
    "name": "Slot Machine",
    "link": "https://github.com/R1zzo23/csharp-slot-machine",
    "devType": "C#/.NET",
    "bullet1": "Created a casino slot machine in C# with a web form.",
    "bullet2": "The main takeaway I learned from this project was to really fine tune my functions to make sure they did one thing flawlessly. I was in a bad habit of making functions that were responsible for doing more than one thing. Looking through the code on this project, it’s clean, concise and easy to follow along as to what everything does."
  },
  {
    "name": "War Card Game",
    "link": "https://github.com/R1zzo23/csharp-war-card-game",
    "devType": "C#/.NET",
    "bullet1": "Automates the game of war between two players for 20 rounds and declares a winner or a tie.",
    "bullet2": "This project taught me a lot about Object Oriented Programming, creating classes and utilizing their properties to represent all the objects I needed to play out the game."
  }
]
